test/dummy/app/views/home/index.html.erb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."organization_id" = 4
SELECT "users".* FROM "users" WHERE "users"."id" IN (4, 5)
---
        <div class="divide-y divide-gray-100">
          <% current_organization.memberships.includes(:user).each do |membership| %>