test/dummy/app/views/home/index.html.erb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."organization_id" = 9
SELECT "users".* FROM "users" WHERE "users"."id" IN (14, 15)
---
        <div class="divide-y divide-gray-100">
          <% current_organization.memberships.includes(:user).each do |membership| %>

SELECT "users".* FROM "users" WHERE "users"."id" = 7
---
                <span class="inline-flex h-11 w-11 items-center justify-center rounded-full <%= membership.user_id == current_user.id ? 'bg-slate-600 text-white' : 'bg-gray-100 text-gray-600' %> font-semibold text-sm">
                  <%= membership.user.email.first.upcase %>

INSERT INTO "memberships" ("user_id", "organization_id", "invited_by_id", "role", "metadata", "created_at", "updated_at") VALUES (1, 1, NULL, 'owner', '{}', '2026-02-19 03:13:03.153680', '2026-02-19 03:13:03.153680') RETURNING "id"
---
                  </p>
                  <p class="text-xs text-gray-500 mt-0.5">Joined <%= time_ago_in_words(membership.created_at) %> ago</p>

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 16
---
                  <div class="h-14 w-14 rounded-xl bg-white/20 backdrop-blur flex items-center justify-center shadow-lg">
                    <span class="text-2xl font-bold text-white"><%= invitation.organization.name.first.upcase %></span>