test/dummy/app/views/organizations/memberships/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."email" = 'test-101ccd27d3863606d76a8d7eed362bf3@example.com' LIMIT 1
---
                <span class="inline-flex h-10 w-10 items-center justify-center rounded-full <%= is_current_user ? 'bg-slate-600 text-white' : 'bg-gray-200 text-gray-600' %> font-medium">
                  <%= membership.user.email.first.upcase %>