test/dummy/app/views/shared/_header.html.erb

            <%# Switch organization %>
            <% other_orgs = current_user.organizations.where.not(id: current_organization.id) %>
---
SELECT "organizations".* FROM "organizations" INNER JOIN "memberships" ON "organizations"."id" = "memberships"."organization_id" WHERE "memberships"."user_id" = 6 AND "organizations"."id" != 8

            <p class="px-3 py-1 text-xs font-medium text-gray-500 uppercase tracking-wider">Switch Demo User</p>
            <% all_users = User.order(:created_at) %>
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" ASC