test/dummy/app/views/shared/_sidebar.html.erb

      <%# Organization switcher %>
      <% if current_user && current_user.organizations.count > 1 %>
---
SELECT "organizations".* FROM "organizations" INNER JOIN "memberships" ON "organizations"."id" = "memberships"."organization_id" WHERE "memberships"."user_id" = 15
SELECT COUNT(*) FROM "organizations" INNER JOIN "memberships" ON "organizations"."id" = "memberships"."organization_id" WHERE "memberships"."user_id" = 18