test/dummy/app/views/organizations/organizations/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN (4, 5)
SELECT "memberships".* FROM "memberships" WHERE "memberships"."organization_id" = 7
---
    <div class="divide-y divide-gray-200">
      <% @organization.memberships.includes(:user).each do |membership| %>

SELECT "users".* FROM "users" WHERE "users"."id" IN (4, 5)
---
            <span class="inline-flex h-10 w-10 items-center justify-center rounded-full bg-gray-200 text-gray-600 font-medium">
              <%= membership.user.email.first.upcase %>

SELECT "memberships".* FROM "memberships" WHERE "memberships"."organization_id" = 3 AND "memberships"."role" = 'owner' LIMIT 1
---
  <%
    other_members = current_organization.memberships
      .includes(:user)
      .where.not(user_id: current_user.id)
      .where.not(role: 'owner')