test/dummy/app/controllers/application_controller.rb

  def current_user
    @current_user ||= begin
      if session[:demo_user_id]
        User.find_by(id: session[:demo_user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1

  def switch_user
    if params[:email].present?
      # Switch to existing user or create new one
      user = User.find_or_create_by(email: params[:email].downcase.strip)
---
INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES ('juan@juan.com', NULL, '2026-02-19 03:26:26.280162', '2026-02-19 03:26:26.280162') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'juan@juan.com' LIMIT 1

  def reset_demo!
    # Delete all demo data
    Organizations::Invitation.delete_all
    Organizations::Membership.delete_all
    Organizations::Organization.delete_all
---
DELETE FROM "organizations"
DELETE FROM "memberships"

  def create_default_demo_user
    # Generate a realistic-looking name from predefined lists
    # Seed with session ID for consistency within the same session
    seed = Digest::SHA256.hexdigest(session.id.to_s)[0, 8].to_i(16)
    rng = Random.new(seed)

    first_name = DEMO_FIRST_NAMES[rng.rand(DEMO_FIRST_NAMES.length)]
    last_name = DEMO_LAST_NAMES[rng.rand(DEMO_LAST_NAMES.length)]
    full_name = "#{first_name} #{last_name}"
    email = "#{first_name.downcase}.#{last_name.downcase}@example.com"

    user = User.find_or_create_by(email: email) do |u|
---
INSERT INTO "users" ("email", "name", "created_at", "updated_at") VALUES ('demo-9818e8@example.com', 'Demo User 9818E8', '2026-02-19 03:25:54.375434', '2026-02-19 03:25:54.375434') RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = 'demo-9818e8@example.com' LIMIT 1