test/dummy/app/views/organizations/invitations/show.html.erb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 16 LIMIT 1
---
        <div class="mx-auto h-20 w-20 rounded-2xl bg-white/20 backdrop-blur flex items-center justify-center mb-5 shadow-lg">
          <span class="text-3xl font-bold text-white"><%= @invitation.organization.name.first.upcase %></span>